Tekla Open API Reference for Tekla Structures 2025
Drawing.Mark Property
 The drawing mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Mark { get; }
Public ReadOnly Property Mark As String
	Get
Property Value
Type: String
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace